t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_epwmxbar.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the OUT8MUXENABLE32TO64 register
//
//*************************************************************************************************
#define XBAR_OUT8MUXENABLE32TO64_MUX32   0x1U          // MUX32 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX33   0x2U          // MUX33 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX34   0x4U          // MUX34 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX35   0x8U          // MUX35 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX36   0x10U         // MUX36 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX37   0x20U         // MUX37 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX38   0x40U         // MUX38 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX39   0x80U         // MUX39 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX40   0x100U        // MUX40 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX41   0x200U        // MUX41 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX42   0x400U        // MUX42 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX43   0x800U        // MUX43 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX44   0x1000U       // MUX44 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX45   0x2000U       // MUX45 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX46   0x4000U       // MUX46 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX47   0x8000U       // MUX47 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX48   0x10000U      // MUX48 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX49   0x20000U      // MUX49 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX50   0x40000U      // MUX50 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX51   0x80000U      // MUX51 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX52   0x100000U     // MUX52 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX53   0x200000U     // MUX53 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX54   0x400000U     // MUX54 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX55   0x800000U     // MUX55 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX56   0x1000000U    // MUX56 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX57   0x2000000U    // MUX57 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX58   0x4000000U    // MUX58 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX59   0x8000000U    // MUX59 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX60   0x10000000U   // MUX60 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX61   0x20000000U   // MUX61 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX62   0x40000000U   // MUX62 to drive OUT8 of EPWM-XBAR
#define XBAR_OUT8MUXENABLE32TO64_MUX63   0x80000000U   // MUX63 to drive OUT8 of EPWM-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the TRIPOUTINV register
//
//*************************************************************************************************
#define XBAR_TRIPOUTINV_OUT0   0x1U    // Selects polarity for OUT0 of EPWM-XBAR
#define XBAR_TRIPOUTINV_OUT1   0x2U    // Selects polarity for OUT1 of EPWM-XBAR
#define XBAR_TRIPOUTINV_OUT2   0x4U    // Selects polarity for OUT2 of EPWM-XBAR
#define XBAR_TRIPOUTINV_OUT3   0x8U    // Selects polarity for OUT3 of EPWM-XBAR
#define XBAR_TRIPOUTINV_OUT4   0x10U   // Selects polarity for OUT4 of EPWM-XBAR
#define XBAR_TRIPOUTINV_OUT5   0x20U   // Selects polarity for OUT5 of EPWM-XBAR
#define XBAR_TRIPOUTINV_OUT6   0x40U   // Selects polarity for OUT6 of EPWM-XBAR
#define XBAR_TRIPOUTINV_OUT7   0x80U   // Selects polarity for OUT7 of EPWM-XBAR

//*************************************************************************************************
//
// The following are defines for the bit fields in the TRIPLOCK register
//
//*************************************************************************************************
#define XBAR_TRIPLOCK_LOCK    0x1U          // Locks the configuration for EPWM-XBAR
#define XBAR_TRIPLOCK_KEY_S   16U
#define XBAR_TRIPLOCK_KEY_M   0xFFFF0000U   // Write protection KEY



#endif
